# Data Cleaning

In [2]:
import numpy as np
import pandas as pd

original_data_path = "data"
cleaned_data_path = "cleaned_data"

In [3]:
# Routine that checks uniqueness of specific columns
def check_uniqueness(df, col_names):
    not_unique = []
    for col in col_names:
        isUnique = df[col].is_unique
        if not isUnique:
            print(col + " is not unique!")
            not_unique.append(col)

    return not_unique

In [4]:
# Routine that checks number of null values of specific columns
def check_nulls(df, col_names):
    cols_with_nulls = []
    for col in col_names:
        nulls = df[col].isnull().sum()
        if nulls>0:
            print(col + f" has {nulls} null values!")
            cols_with_nulls.append(col)

    return cols_with_nulls

In [5]:
def num_of_unique(df, col_names):
    for col in col_names:
        print(f"Number of unique values in column {col}: {len(df[col].unique())}")

In [6]:
def show_unique(df, col_names):
    for col in col_names:
        print(f"Unique values in column {col}: {df[col].unique()}")

### Routes

In [7]:
routes_df = pd.read_csv(f"{original_data_path}/routes.txt")
routes_df.head(2)

,route_id,agency_id,route_short_name,route_long_name,route_desc,route_type,route_url,route_color,route_text_color
0,2,1,2,Unutrašnji Krug - Spoljašnji Krug,NaN,0,NaN,FF0000,FFFFFF
1,5,1,5,Kalemegdan /Donji Grad/ - Ustanička,NaN,0,NaN,FF0000,FFFFFF

In [8]:
routes_df.shape

(214, 9)

In [9]:
routes_df.route_type.unique()

array([  0,   3, 800, 702])

Comment: 0 - tramvaji, 3 - autobusi, 702 - E linije, 800 - trole

In [10]:
null_columns = check_nulls(routes_df,routes_df.columns)
print("Null columns: ", null_columns)

route_desc has 214 null values!
route_url has 214 null values!
Null columns:  ['route_desc', 'route_url']

In [11]:
# drop columns with NaN values
routes_df.drop(null_columns, axis=1, inplace=True)

In [12]:
check_uniqueness(routes_df, routes_df.columns)

agency_id is not unique!
route_long_name is not unique!
route_type is not unique!
route_color is not unique!
route_text_color is not unique!

['agency_id',
 'route_long_name',
 'route_type',
 'route_color',
 'route_text_color']

Comment: route_long_name not unique, which is unusual and should be checked.

In [13]:
# drop unnecessary columns
routes_df.drop(['agency_id', 'route_color', 'route_text_color'], axis=1, inplace=True)

In [14]:
routes_df.head(1)

   route_id route_short_name                    route_long_name  route_type
0         2                2  Unutrašnji Krug - Spoljašnji Krug           0

In [15]:
routes_df.to_csv('cleaned_data/routes.csv', index=False)

### Trips

In [16]:
trips_df = pd.read_csv(f"{original_data_path}/trips.txt")
trips_df.head(2)

,route_id,service_id,trip_id,trip_headsign,direction_id,block_id,shape_id,wheelchair_accessible,bikes_allowed
0,2,Zimski-Subota,1421378,Spoljašnji Krug,0,NaN,00002_shape_0,0,0
1,2,Zimski-Subota,1421379,Spoljašnji Krug,0,NaN,00002_shape_0,0,0

In [17]:
trips_df.shape

(65027, 9)

In [18]:
trips_df.service_id.unique()

array(['Zimski-Subota', 'Zimski-Nedelja', 'Zimski-Radni Dan'],
      dtype=object)

Comment: Only winter schedule is included.

In [19]:
null_columns = check_nulls(trips_df, trips_df.columns)
print("Null columns: ", null_columns)

block_id has 65027 null values!
Null columns:  ['block_id']

In [20]:
# drop columns with NaN values
trips_df.drop(null_columns, axis=1, inplace=True)

In [21]:
check_uniqueness(routes_df, routes_df.columns)

route_long_name is not unique!
route_type is not unique!

['route_long_name', 'route_type']

In [22]:
# drop unnecessary columns
trips_df.drop(['trip_headsign', 'shape_id', 'wheelchair_accessible', 'bikes_allowed'], axis=1, inplace=True)

In [23]:
trips_df.to_csv('cleaned_data/trips.csv', index=False)

### Stops

In [24]:
stops_df = pd.read_csv(f"{original_data_path}/stops.txt")
stops_df.head(2)

,stop_id,stop_code,stop_name,stop_desc,stop_lat,stop_lon,zone_id,stop_url,location_type,parent_station,stop_timezone,wheelchair_boarding
0,1,1,Kalemegdan (Donji Grad),NaN,44.826810,20.453274,1,NaN,0,NaN,NaN,0
1,2,2,Tadeuša Košćuška,NaN,44.825917,20.455243,1,NaN,0,NaN,NaN,0

In [25]:
stops_df.shape

(3130, 12)

In [26]:
null_columns = check_nulls(stops_df, stops_df.columns)
print("Null columns: ", null_columns)

stop_desc has 3130 null values!
stop_url has 3130 null values!
parent_station has 3130 null values!
stop_timezone has 3130 null values!
Null columns:  ['stop_desc', 'stop_url', 'parent_station', 'stop_timezone']

In [27]:
# drop columns with NaN values
stops_df.drop(null_columns, axis=1, inplace=True)

In [28]:
not_unique = check_uniqueness(stops_df, stops_df.columns)
print("Columns that are not unique: ", not_unique)

stop_name is not unique!
stop_lat is not unique!
stop_lon is not unique!
zone_id is not unique!
location_type is not unique!
wheelchair_boarding is not unique!
Columns that are not unique:  ['stop_name', 'stop_lat', 'stop_lon', 'zone_id', 'location_type', 'wheelchair_boarding']

In [29]:
num_of_unique(stops_df, not_unique)

Number of unique values in column stop_name: 1504
Number of unique values in column stop_lat: 3118
Number of unique values in column stop_lon: 3119
Number of unique values in column zone_id: 3
Number of unique values in column location_type: 1
Number of unique values in column wheelchair_boarding: 1

In [30]:
show_unique(stops_df, ['zone_id','wheelchair_boarding', 'location_type' ])

Unique values in column zone_id: [1 2 3]
Unique values in column wheelchair_boarding: [0]
Unique values in column location_type: [0]

Comment: Data exists only for zones 1, 2 and 3.

In [31]:
(stops_df['stop_code'] != stops_df['stop_id']).sum()

0

Comment: stop_code and stop_id are the same, so we can remove stop_code.

In [32]:
# drop unnecessary columns
stops_df.drop(['stop_code', 'location_type', 'wheelchair_boarding'], axis=1, inplace=True)

In [33]:
stops_df.to_csv('cleaned_data/stops.csv', index=False)

### Stop_times

In [78]:
stop_times_df = pd.read_csv(f"{original_data_path}/stop_times.txt", low_memory=False)
stop_times_df.head(2)

,trip_id,arrival_time,departure_time,stop_id,stop_sequence,stop_headsign,pickup_type,drop_off_type,shape_dist_traveled,timepoint
0,665800,20:00:00,20:00:00,638,1,NaN,NaN,NaN,NaN,0
1,665800,20:01:00,20:01:00,148,2,NaN,NaN,NaN,NaN,0

In [79]:
stop_times_df.shape

(1647981, 10)

In [80]:
null_columns = check_nulls(stop_times_df,stop_times_df.columns)
print("Null columns: ", null_columns)

stop_headsign has 1619700 null values!
pickup_type has 1647981 null values!
drop_off_type has 1647981 null values!
shape_dist_traveled has 1647981 null values!
Null columns:  ['stop_headsign', 'pickup_type', 'drop_off_type', 'shape_dist_traveled']

In [81]:
# drop columns with NaN values
stop_times_df.drop(['stop_headsign', 'pickup_type', 'drop_off_type', 'shape_dist_traveled'], axis=1, inplace=True)

In [82]:
# is arrival_time always equal to departure_time (when not null)?
sum(stop_times_df.arrival_time!=stop_times_df.departure_time)

0

Comment: arrival_time and departure_time are always identical, meaning that the bus/train departures immediately upon arival.

In [83]:
stop_times_df.head(2)

   trip_id arrival_time departure_time  stop_id  stop_sequence  timepoint
0   665800     20:00:00       20:00:00      638              1          0
1   665800     20:01:00       20:01:00      148              2          0

In [84]:
num_of_unique(stop_times_df, ['timepoint'])

Number of unique values in column timepoint: 1

In [85]:
# drop unnecessary columns
stop_times_df.drop(['departure_time', 'timepoint'], axis=1, inplace=True)

Comment: timepoint column values are always equal to 1, so we can drop it.

In [86]:
# check if time format is valid
def is_valid_time(value):
    try:
        pd.to_datetime(value, format='%H:%M:%S')
        return True
    except ValueError:
        return False

In [87]:
# filter out all the rows with the wrong format
mask = stop_times_df['arrival_time'].apply(is_valid_time)
print("Number of rows with wrong time format: ", stop_times_df.shape[0]-mask.sum())
stop_times_df = stop_times_df[mask]

Number of rows with wrong time format:  18966

In [90]:
# # convert string to datetime format
# stop_times_df['arrival_time'] = pd.to_datetime(stop_times_df['arrival_time'], format='%H:%M:%S')

In [96]:
stop_times_df.to_csv('cleaned_data/stop_times.csv', index=False, date_format='%H:%M:%S')

### Transfers

In [ ]:
transfers_df = pd.read_csv(f"{original_data_path}/transfers.txt")
transfers_df.head(2)

Empty DataFrame
Columns: [from_stop_id, to_stop_id, transfer_type, min_transfer_time]
Index: []

Comment: Table not relevant.

### Calendar

In [46]:
calendar_df = pd.read_csv(f"{original_data_path}/calendar.txt")
calendar_df.head()

,service_id,monday,tuesday,wednesday,thursday,friday,saturday,sunday,start_date,end_date
0,Letnji-Radni Dan,1,1,1,1,1,0,0,20230630,20230901
1,Letnji-Subota,0,0,0,0,0,1,0,20230630,20230901
2,Letnji-Nedelja,0,0,0,0,0,0,1,20230630,20230901
3,Zimski-Radni Dan,1,1,1,1,1,0,0,20220901,20230901
4,Zimski-Subota,0,0,0,0,0,1,0,20220901,20230901

In [47]:
calendar_df.shape

(6, 10)

### Calendar_dates

In [48]:
calendar_dates_df = pd.read_csv(f"{original_data_path}/calendar_dates.txt")
calendar_dates_df.head()

         service_id      date  exception_type
0  Zimski-Radni Dan  20191111               2
1     Zimski-Subota  20191111               1
2  Zimski-Radni Dan  20200101               2
3  Zimski-Radni Dan  20200102               2
4  Zimski-Radni Dan  20200107               2

In [49]:
calendar_dates_df.shape

(8, 3)

### Agency

In [50]:
agency_df = pd.read_csv(f"{original_data_path}/agency.txt")
agency_df.head(2)

,agency_id,agency_name,agency_url,agency_timezone,agency_lang,agency_phone,agency_fare_url
0,1,Gradska uprava grada Beograda Sekretarijat za ...,http://www.bgprevoz.rs,Europe/Belgrade,sr,+381(11)3300-801,http://www.bgprevoz.rs/naplata/cene-karata/nep...

Comment: Table is irrelevant.

### Fare attributes

In [51]:
fare_att_df = pd.read_csv(f"{original_data_path}/fare_attributes.txt")
fare_att_df.head()

,fare_id,price,currency_type,payment_method,transfers,transfer_duration
0,!F1_to_F1,89,RSD,0,NaN,5400
1,!F1_to_F2,89,RSD,0,NaN,5400
2,!F2_to_F1,89,RSD,0,NaN,5400
3,!F2_to_F2,89,RSD,0,NaN,5400
4,!F3_to_F3,89,RSD,0,NaN,5400

In [52]:
fare_att_df.shape

(9, 6)

Comment: Table is irrelevant.

### Fare rules

In [53]:
fare_rules_df = pd.read_csv(f"{original_data_path}/fare_rules.txt")
fare_rules_df.head()

     fare_id  route_id  origin_id  destination_id  contains_id
0  !F1_to_F1       NaN          1               1          NaN
1  !F1_to_F2       NaN          1               2          NaN
2  !F1_to_F3       NaN          1               3          NaN
3  !F2_to_F1       NaN          2               1          NaN
4  !F2_to_F2       NaN          2               2          NaN

Comment: Table is irrelevant.

### Feed info

In [54]:
feed_info_df = pd.read_csv(f"{original_data_path}/feed_info.txt")
feed_info_df.head()

,feed_publisher_name,feed_publisher_url,feed_lang,feed_start_date,feed_end_date,feed_version
0,Kentkart Southeast Europe d.o.o. Beograd,http://www.busplus.rs,sr,20220831,20230630,20220831

Comment: Table is irrelevant.

### Shapes

In [55]:
shapes_df = pd.read_csv(f"{original_data_path}/shapes.txt")
shapes_df.head()

,shape_id,shape_pt_lat,shape_pt_lon,shape_pt_sequence,shape_dist_traveled
0,00002_shape_0,44.819244,20.449545,0,0.00000
1,00002_shape_0,44.819631,20.449592,1,0.04331
2,00002_shape_0,44.819757,20.449578,2,0.05740
3,00002_shape_0,44.819856,20.449488,3,0.07053
4,00002_shape_0,44.820151,20.449030,4,0.11945

Comment: Table is irrelevant.

### Frequencies

In [56]:
freq_df = pd.read_csv(f"{original_data_path}/frequencies.txt")
freq_df.head()

Empty DataFrame
Columns: [trip_id, start_time, end_time, headway_secs, exact_times]
Index: []

Comment: Table is irrelevant.

## Merging cleaned datasets

In [57]:
routes_df = pd.read_csv(f"{cleaned_data_path}/routes.csv")
routes_df.head(2)

   route_id route_short_name                      route_long_name  route_type
0         2                2    Unutrašnji Krug - Spoljašnji Krug           0
1         5                5  Kalemegdan /Donji Grad/ - Ustanička           0

In [58]:
trips_df = pd.read_csv(f"{cleaned_data_path}/trips.csv")
trips_df.head(2)

   route_id     service_id  trip_id  direction_id
0         2  Zimski-Subota  1421378             0
1         2  Zimski-Subota  1421379             0

In [59]:
stops_df = pd.read_csv(f"{cleaned_data_path}/stops.csv")
stops_df.head(2)

   stop_id                stop_name   stop_lat   stop_lon  zone_id
0        1  Kalemegdan (Donji Grad)  44.826810  20.453274        1
1        2         Tadeuša Košćuška  44.825917  20.455243        1

In [60]:
stop_times_df = pd.read_csv(f"{cleaned_data_path}/stop_times.csv")
stop_times_df.head(2)

   trip_id arrival_time  stop_id  stop_sequence
0   665800     20:00:00      638              1
1   665800     20:01:00      148              2

In [61]:
stopsRoutes = stop_times_df[['stop_id', 'trip_id']].merge(trips_df[['trip_id', 'route_id']], on='trip_id')
stopsRoutes.head()

   stop_id  trip_id  route_id
0      638   665800       401
1      148   665800       401
2      746   665800       401
3      845   665800       401
4      847   665800       401

In [62]:
num_of_unique(stopsRoutes, stopsRoutes.columns)

Number of unique values in column stop_id: 3127
Number of unique values in column trip_id: 64703
Number of unique values in column route_id: 179

In [63]:
stopsRoutes.drop(['trip_id'], axis=1, inplace=True)
stopsRoutes.drop_duplicates(inplace=True)

In [64]:
stopsRoutes.head()

   stop_id  route_id
0      638       401
1      148       401
2      746       401
3      845       401
4      847       401

In [65]:
stopsRoutes = stopsRoutes.merge(stops_df[['stop_id', 'stop_name']], on='stop_id')

In [66]:
stopsRoutes.shape

(8303, 3)

In [67]:
stopsRoutes.drop_duplicates(inplace=True)

In [68]:
stopsRoutes.shape

(8303, 3)

In [69]:
stopsRoutes.head()

   stop_id  route_id    stop_name
0      638       401  Birčaninova
1      638        59  Birčaninova
2      638        39  Birčaninova
3      638        47  Birčaninova
4      638       402  Birčaninova

In [70]:
stopsRoutes.to_csv('cleaned_data/stops_routes.csv', index=False)